let city_object = {
    "110100": {
        "name": "市辖区",
        "province": "北京市",
        "id": "110100"
    },
    "110200": {
        "name": "县",
        "province": "北京市",
        "id": "110200"
    },
    "120100": {
        "name": "市辖区",
        "province": "天津市",
        "id": "120100"
    },
    "120200": {
        "name": "县",
        "province": "天津市",
        "id": "120200"
    },
    "130100": {
        "name": "石家庄市",
        "province": "河北省",
        "id": "130100"
    },
    "130200": {
        "name": "唐山市",
        "province": "河北省",
        "id": "130200"
    },
    "130300": {
        "name": "秦皇岛市",
        "province": "河北省",
        "id": "130300"
    },
    "130400": {
        "name": "邯郸市",
        "province": "河北省",
        "id": "130400"
    },
    "130500": {
        "name": "邢台市",
        "province": "河北省",
        "id": "130500"
    },
    "130600": {
        "name": "保定市",
        "province": "河北省",
        "id": "130600"
    },
    "130700": {
        "name": "张家口市",
        "province": "河北省",
        "id": "130700"
    },
    "130800": {
        "name": "承德市",
        "province": "河北省",
        "id": "130800"
    },
    "130900": {
        "name": "沧州市",
        "province": "河北省",
        "id": "130900"
    },
    "131000": {
        "name": "廊坊市",
        "province": "河北省",
        "id": "131000"
    },
    "131100": {
        "name": "衡水市",
        "province": "河北省",
        "id": "131100"
    },
    "140100": {
        "name": "太原市",
        "province": "山西省",
        "id": "140100"
    },
    "140200": {
        "name": "大同市",
        "province": "山西省",
        "id": "140200"
    },
    "140300": {
        "name": "阳泉市",
        "province": "山西省",
        "id": "140300"
    },
    "140400": {
        "name": "长治市",
        "province": "山西省",
        "id": "140400"
    },
    "140500": {
        "name": "晋城市",
        "province": "山西省",
        "id": "140500"
    },
    "140600": {
        "name": "朔州市",
        "province": "山西省",
        "id": "140600"
    },
    "140700": {
        "name": "晋中市",
        "province": "山西省",
        "id": "140700"
    },
    "140800": {
        "name": "运城市",
        "province": "山西省",
        "id": "140800"
    },
    "140900": {
        "name": "忻州市",
        "province": "山西省",
        "id": "140900"
    },
    "141000": {
        "name": "临汾市",
        "province": "山西省",
        "id": "141000"
    },
    "141100": {
        "name": "吕梁市",
        "province": "山西省",
        "id": "141100"
    },
    "150100": {
        "name": "呼和浩特市",
        "province": "内蒙古自治区",
        "id": "150100"
    },
    "150200": {
        "name": "包头市",
        "province": "内蒙古自治区",
        "id": "150200"
    },
    "150300": {
        "name": "乌海市",
        "province": "内蒙古自治区",
        "id": "150300"
    },
    "150400": {
        "name": "赤峰市",
        "province": "内蒙古自治区",
        "id": "150400"
    },
    "150500": {
        "name": "通辽市",
        "province": "内蒙古自治区",
        "id": "150500"
    },
    "150600": {
        "name": "鄂尔多斯市",
        "province": "内蒙古自治区",
        "id": "150600"
    },
    "150700": {
        "name": "呼伦贝尔市",
        "province": "内蒙古自治区",
        "id": "150700"
    },
    "150800": {
        "name": "巴彦淖尔市",
        "province": "内蒙古自治区",
        "id": "150800"
    },
    "150900": {
        "name": "乌兰察布市",
        "province": "内蒙古自治区",
        "id": "150900"
    },
    "152200": {
        "name": "兴安盟",
        "province": "内蒙古自治区",
        "id": "152200"
    },
    "152500": {
        "name": "锡林郭勒盟",
        "province": "内蒙古自治区",
        "id": "152500"
    },
    "152900": {
        "name": "阿拉善盟",
        "province": "内蒙古自治区",
        "id": "152900"
    },
    "210100": {
        "name": "沈阳市",
        "province": "辽宁省",
        "id": "210100"
    },
    "210200": {
        "name": "大连市",
        "province": "辽宁省",
        "id": "210200"
    },
    "210300": {
        "name": "鞍山市",
        "province": "辽宁省",
        "id": "210300"
    },
    "210400": {
        "name": "抚顺市",
        "province": "辽宁省",
        "id": "210400"
    },
    "210500": {
        "name": "本溪市",
        "province": "辽宁省",
        "id": "210500"
    },
    "210600": {
        "name": "丹东市",
        "province": "辽宁省",
        "id": "210600"
    },
    "210700": {
        "name": "锦州市",
        "province": "辽宁省",
        "id": "210700"
    },
    "210800": {
        "name": "营口市",
        "province": "辽宁省",
        "id": "210800"
    },
    "210900": {
        "name": "阜新市",
        "province": "辽宁省",
        "id": "210900"
    },
    "211000": {
        "name": "辽阳市",
        "province": "辽宁省",
        "id": "211000"
    },
    "211100": {
        "name": "盘锦市",
        "province": "辽宁省",
        "id": "211100"
    },
    "211200": {
        "name": "铁岭市",
        "province": "辽宁省",
        "id": "211200"
    },
    "211300": {
        "name": "朝阳市",
        "province": "辽宁省",
        "id": "211300"
    },
    "211400": {
        "name": "葫芦岛市",
        "province": "辽宁省",
        "id": "211400"
    },
    "220100": {
        "name": "长春市",
        "province": "吉林省",
        "id": "220100"
    },
    "220200": {
        "name": "吉林市",
        "province": "吉林省",
        "id": "220200"
    },
    "220300": {
        "name": "四平市",
        "province": "吉林省",
        "id": "220300"
    },
    "220400": {
        "name": "辽源市",
        "province": "吉林省",
        "id": "220400"
    },
    "220500": {
        "name": "通化市",
        "province": "吉林省",
        "id": "220500"
    },
    "220600": {
        "name": "白山市",
        "province": "吉林省",
        "id": "220600"
    },
    "220700": {
        "name": "松原市",
        "province": "吉林省",
        "id": "220700"
    },
    "220800": {
        "name": "白城市",
        "province": "吉林省",
        "id": "220800"
    },
    "222400": {
        "name": "延边朝鲜族自治州",
        "province": "吉林省",
        "id": "222400"
    },
    "230100": {
        "name": "哈尔滨市",
        "province": "黑龙江省",
        "id": "230100"
    },
    "230200": {
        "name": "齐齐哈尔市",
        "province": "黑龙江省",
        "id": "230200"
    },
    "230300": {
        "name": "鸡西市",
        "province": "黑龙江省",
        "id": "230300"
    },
    "230400": {
        "name": "鹤岗市",
        "province": "黑龙江省",
        "id": "230400"
    },
    "230500": {
        "name": "双鸭山市",
        "province": "黑龙江省",
        "id": "230500"
    },
    "230600": {
        "name": "大庆市",
        "province": "黑龙江省",
        "id": "230600"
    },
    "230700": {
        "name": "伊春市",
        "province": "黑龙江省",
        "id": "230700"
    },
    "230800": {
        "name": "佳木斯市",
        "province": "黑龙江省",
        "id": "230800"
    },
    "230900": {
        "name": "七台河市",
        "province": "黑龙江省",
        "id": "230900"
    },
    "231000": {
        "name": "牡丹江市",
        "province": "黑龙江省",
        "id": "231000"
    },
    "231100": {
        "name": "黑河市",
        "province": "黑龙江省",
        "id": "231100"
    },
    "231200": {
        "name": "绥化市",
        "province": "黑龙江省",
        "id": "231200"
    },
    "232700": {
        "name": "大兴安岭地区",
        "province": "黑龙江省",
        "id": "232700"
    },
    "310100": {
        "name": "市辖区",
        "province": "上海市",
        "id": "310100"
    },
    "310200": {
        "name": "县",
        "province": "上海市",
        "id": "310200"
    },
    "320100": {
        "name": "南京市",
        "province": "江苏省",
        "id": "320100"
    },
    "320200": {
        "name": "无锡市",
        "province": "江苏省",
        "id": "320200"
    },
    "320300": {
        "name": "徐州市",
        "province": "江苏省",
        "id": "320300"
    },
    "320400": {
        "name": "常州市",
        "province": "江苏省",
        "id": "320400"
    },
    "320500": {
        "name": "苏州市",
        "province": "江苏省",
        "id": "320500"
    },
    "320600": {
        "name": "南通市",
        "province": "江苏省",
        "id": "320600"
    },
    "320700": {
        "name": "连云港市",
        "province": "江苏省",
        "id": "320700"
    },
    "320800": {
        "name": "淮安市",
        "province": "江苏省",
        "id": "320800"
    },
    "320900": {
        "name": "盐城市",
        "province": "江苏省",
        "id": "320900"
    },
    "321000": {
        "name": "扬州市",
        "province": "江苏省",
        "id": "321000"
    },
    "321100": {
        "name": "镇江市",
        "province": "江苏省",
        "id": "321100"
    },
    "321200": {
        "name": "泰州市",
        "province": "江苏省",
        "id": "321200"
    },
    "321300": {
        "name": "宿迁市",
        "province": "江苏省",
        "id": "321300"
    },
    "330100": {
        "name": "杭州市",
        "province": "浙江省",
        "id": "330100"
    },
    "330200": {
        "name": "宁波市",
        "province": "浙江省",
        "id": "330200"
    },
    "330300": {
        "name": "温州市",
        "province": "浙江省",
        "id": "330300"
    },
    "330400": {
        "name": "嘉兴市",
        "province": "浙江省",
        "id": "330400"
    },
    "330500": {
        "name": "湖州市",
        "province": "浙江省",
        "id": "330500"
    },
    "330600": {
        "name": "绍兴市",
        "province": "浙江省",
        "id": "330600"
    },
    "330700": {
        "name": "金华市",
        "province": "浙江省",
        "id": "330700"
    },
    "330800": {
        "name": "衢州市",
        "province": "浙江省",
        "id": "330800"
    },
    "330900": {
        "name": "舟山市",
        "province": "浙江省",
        "id": "330900"
    },
    "331000": {
        "name": "台州市",
        "province": "浙江省",
        "id": "331000"
    },
    "331100": {
        "name": "丽水市",
        "province": "浙江省",
        "id": "331100"
    },
    "340100": {
        "name": "合肥市",
        "province": "安徽省",
        "id": "340100"
    },
    "340200": {
        "name": "芜湖市",
        "province": "安徽省",
        "id": "340200"
    },
    "340300": {
        "name": "蚌埠市",
        "province": "安徽省",
        "id": "340300"
    },
    "340400": {
        "name": "淮南市",
        "province": "安徽省",
        "id": "340400"
    },
    "340500": {
        "name": "马鞍山市",
        "province": "安徽省",
        "id": "340500"
    },
    "340600": {
        "name": "淮北市",
        "province": "安徽省",
        "id": "340600"
    },
    "340700": {
        "name": "铜陵市",
        "province": "安徽省",
        "id": "340700"
    },
    "340800": {
        "name": "安庆市",
        "province": "安徽省",
        "id": "340800"
    },
    "341000": {
        "name": "黄山市",
        "province": "安徽省",
        "id": "341000"
    },
    "341100": {
        "name": "滁州市",
        "province": "安徽省",
        "id": "341100"
    },
    "341200": {
        "name": "阜阳市",
        "province": "安徽省",
        "id": "341200"
    },
    "341300": {
        "name": "宿州市",
        "province": "安徽省",
        "id": "341300"
    },
    "341400": {
        "name": "巢湖市",
        "province": "安徽省",
        "id": "341400"
    },
    "341500": {
        "name": "六安市",
        "province": "安徽省",
        "id": "341500"
    },
    "341600": {
        "name": "亳州市",
        "province": "安徽省",
        "id": "341600"
    },
    "341700": {
        "name": "池州市",
        "province": "安徽省",
        "id": "341700"
    },
    "341800": {
        "name": "宣城市",
        "province": "安徽省",
        "id": "341800"
    },
    "350100": {
        "name": "福州市",
        "province": "福建省",
        "id": "350100"
    },
    "350200": {
        "name": "厦门市",
        "province": "福建省",
        "id": "350200"
    },
    "350300": {
        "name": "莆田市",
        "province": "福建省",
        "id": "350300"
    },
    "350400": {
        "name": "三明市",
        "province": "福建省",
        "id": "350400"
    },
    "350500": {
        "name": "泉州市",
        "province": "福建省",
        "id": "350500"
    },
    "350600": {
        "name": "漳州市",
        "province": "福建省",
        "id": "350600"
    },
    "350700": {
        "name": "南平市",
        "province": "福建省",
        "id": "350700"
    },
    "350800": {
        "name": "龙岩市",
        "province": "福建省",
        "id": "350800"
    },
    "350900": {
        "name": "宁德市",
        "province": "福建省",
        "id": "350900"
    },
    "360100": {
        "name": "南昌市",
        "province": "江西省",
        "id": "360100"
    },
    "360200": {
        "name": "景德镇市",
        "province": "江西省",
        "id": "360200"
    },
    "360300": {
        "name": "萍乡市",
        "province": "江西省",
        "id": "360300"
    },
    "360400": {
        "name": "九江市",
        "province": "江西省",
        "id": "360400"
    },
    "360500": {
        "name": "新余市",
        "province": "江西省",
        "id": "360500"
    },
    "360600": {
        "name": "鹰潭市",
        "province": "江西省",
        "id": "360600"
    },
    "360700": {
        "name": "赣州市",
        "province": "江西省",
        "id": "360700"
    },
    "360800": {
        "name": "吉安市",
        "province": "江西省",
        "id": "360800"
    },
    "360900": {
        "name": "宜春市",
        "province": "江西省",
        "id": "360900"
    },
    "361000": {
        "name": "抚州市",
        "province": "江西省",
        "id": "361000"
    },
    "361100": {
        "name": "上饶市",
        "province": "江西省",
        "id": "361100"
    },
    "370100": {
        "name": "济南市",
        "province": "山东省",
        "id": "370100"
    },
    "370200": {
        "name": "青岛市",
        "province": "山东省",
        "id": "370200"
    },
    "370300": {
        "name": "淄博市",
        "province": "山东省",
        "id": "370300"
    },
    "370400": {
        "name": "枣庄市",
        "province": "山东省",
        "id": "370400"
    },
    "370500": {
        "name": "东营市",
        "province": "山东省",
        "id": "370500"
    },
    "370600": {
        "name": "烟台市",
        "province": "山东省",
        "id": "370600"
    },
    "370700": {
        "name": "潍坊市",
        "province": "山东省",
        "id": "370700"
    },
    "370800": {
        "name": "济宁市",
        "province": "山东省",
        "id": "370800"
    },
    "370900": {
        "name": "泰安市",
        "province": "山东省",
        "id": "370900"
    },
    "371000": {
        "name": "威海市",
        "province": "山东省",
        "id": "371000"
    },
    "371100": {
        "name": "日照市",
        "province": "山东省",
        "id": "371100"
    },
    "371200": {
        "name": "莱芜市",
        "province": "山东省",
        "id": "371200"
    },
    "371300": {
        "name": "临沂市",
        "province": "山东省",
        "id": "371300"
    },
    "371400": {
        "name": "德州市",
        "province": "山东省",
        "id": "371400"
    },
    "371500": {
        "name": "聊城市",
        "province": "山东省",
        "id": "371500"
    },
    "371600": {
        "name": "滨州市",
        "province": "山东省",
        "id": "371600"
    },
    "371700": {
        "name": "荷泽市",
        "province": "山东省",
        "id": "371700"
    },
    "410100": {
        "name": "郑州市",
        "province": "河南省",
        "id": "410100"
    },
    "410200": {
        "name": "开封市",
        "province": "河南省",
        "id": "410200"
    },
    "410300": {
        "name": "洛阳市",
        "province": "河南省",
        "id": "410300"
    },
    "410400": {
        "name": "平顶山市",
        "province": "河南省",
        "id": "410400"
    },
    "410500": {
        "name": "安阳市",
        "province": "河南省",
        "id": "410500"
    },
    "410600": {
        "name": "鹤壁市",
        "province": "河南省",
        "id": "410600"
    },
    "410700": {
        "name": "新乡市",
        "province": "河南省",
        "id": "410700"
    },
    "410800": {
        "name": "焦作市",
        "province": "河南省",
        "id": "410800"
    },
    "410900": {
        "name": "濮阳市",
        "province": "河南省",
        "id": "410900"
    },
    "411000": {
        "name": "许昌市",
        "province": "河南省",
        "id": "411000"
    },
    "411100": {
        "name": "漯河市",
        "province": "河南省",
        "id": "411100"
    },
    "411200": {
        "name": "三门峡市",
        "province": "河南省",
        "id": "411200"
    },
    "411300": {
        "name": "南阳市",
        "province": "河南省",
        "id": "411300"
    },
    "411400": {
        "name": "商丘市",
        "province": "河南省",
        "id": "411400"
    },
    "411500": {
        "name": "信阳市",
        "province": "河南省",
        "id": "411500"
    },
    "411600": {
        "name": "周口市",
        "province": "河南省",
        "id": "411600"
    },
    "411700": {
        "name": "驻马店市",
        "province": "河南省",
        "id": "411700"
    },
    "420100": {
        "name": "武汉市",
        "province": "湖北省",
        "id": "420100"
    },
    "420200": {
        "name": "黄石市",
        "province": "湖北省",
        "id": "420200"
    },
    "420300": {
        "name": "十堰市",
        "province": "湖北省",
        "id": "420300"
    },
    "420500": {
        "name": "宜昌市",
        "province": "湖北省",
        "id": "420500"
    },
    "420600": {
        "name": "襄樊市",
        "province": "湖北省",
        "id": "420600"
    },
    "420700": {
        "name": "鄂州市",
        "province": "湖北省",
        "id": "420700"
    },
    "420800": {
        "name": "荆门市",
        "province": "湖北省",
        "id": "420800"
    },
    "420900": {
        "name": "孝感市",
        "province": "湖北省",
        "id": "420900"
    },
    "421000": {
        "name": "荆州市",
        "province": "湖北省",
        "id": "421000"
    },
    "421100": {
        "name": "黄冈市",
        "province": "湖北省",
        "id": "421100"
    },
    "421200": {
        "name": "咸宁市",
        "province": "湖北省",
        "id": "421200"
    },
    "421300": {
        "name": "随州市",
        "province": "湖北省",
        "id": "421300"
    },
    "422800": {
        "name": "恩施土家族苗族自治州",
        "province": "湖北省",
        "id": "422800"
    },
    "429000": {
        "name": "省直辖行政单位",
        "province": "湖北省",
        "id": "429000"
    },
    "430100": {
        "name": "长沙市",
        "province": "湖南省",
        "id": "430100"
    },
    "430200": {
        "name": "株洲市",
        "province": "湖南省",
        "id": "430200"
    },
    "430300": {
        "name": "湘潭市",
        "province": "湖南省",
        "id": "430300"
    },
    "430400": {
        "name": "衡阳市",
        "province": "湖南省",
        "id": "430400"
    },
    "430500": {
        "name": "邵阳市",
        "province": "湖南省",
        "id": "430500"
    },
    "430600": {
        "name": "岳阳市",
        "province": "湖南省",
        "id": "430600"
    },
    "430700": {
        "name": "常德市",
        "province": "湖南省",
        "id": "430700"
    },
    "430800": {
        "name": "张家界市",
        "province": "湖南省",
        "id": "430800"
    },
    "430900": {
        "name": "益阳市",
        "province": "湖南省",
        "id": "430900"
    },
    "431000": {
        "name": "郴州市",
        "province": "湖南省",
        "id": "431000"
    },
    "431100": {
        "name": "永州市",
        "province": "湖南省",
        "id": "431100"
    },
    "431200": {
        "name": "怀化市",
        "province": "湖南省",
        "id": "431200"
    },
    "431300": {
        "name": "娄底市",
        "province": "湖南省",
        "id": "431300"
    },
    "433100": {
        "name": "湘西土家族苗族自治州",
        "province": "湖南省",
        "id": "433100"
    },
    "440100": {
        "name": "广州市",
        "province": "广东省",
        "id": "440100"
    },
    "440200": {
        "name": "韶关市",
        "province": "广东省",
        "id": "440200"
    },
    "440300": {
        "name": "深圳市",
        "province": "广东省",
        "id": "440300"
    },
    "440400": {
        "name": "珠海市",
        "province": "广东省",
        "id": "440400"
    },
    "440500": {
        "name": "汕头市",
        "province": "广东省",
        "id": "440500"
    },
    "440600": {
        "name": "佛山市",
        "province": "广东省",
        "id": "440600"
    },
    "440700": {
        "name": "江门市",
        "province": "广东省",
        "id": "440700"
    },
    "440800": {
        "name": "湛江市",
        "province": "广东省",
        "id": "440800"
    },
    "440900": {
        "name": "茂名市",
        "province": "广东省",
        "id": "440900"
    },
    "441200": {
        "name": "肇庆市",
        "province": "广东省",
        "id": "441200"
    },
    "441300": {
        "name": "惠州市",
        "province": "广东省",
        "id": "441300"
    },
    "441400": {
        "name": "梅州市",
        "province": "广东省",
        "id": "441400"
    },
    "441500": {
        "name": "汕尾市",
        "province": "广东省",
        "id": "441500"
    },
    "441600": {
        "name": "河源市",
        "province": "广东省",
        "id": "441600"
    },
    "441700": {
        "name": "阳江市",
        "province": "广东省",
        "id": "441700"
    },
    "441800": {
        "name": "清远市",
        "province": "广东省",
        "id": "441800"
    },
    "441900": {
        "name": "东莞市",
        "province": "广东省",
        "id": "441900"
    },
    "442000": {
        "name": "中山市",
        "province": "广东省",
        "id": "442000"
    },
    "445100": {
        "name": "潮州市",
        "province": "广东省",
        "id": "445100"
    },
    "445200": {
        "name": "揭阳市",
        "province": "广东省",
        "id": "445200"
    },
    "445300": {
        "name": "云浮市",
        "province": "广东省",
        "id": "445300"
    },
    "450100": {
        "name": "南宁市",
        "province": "广西壮族自治区",
        "id": "450100"
    },
    "450200": {
        "name": "柳州市",
        "province": "广西壮族自治区",
        "id": "450200"
    },
    "450300": {
        "name": "桂林市",
        "province": "广西壮族自治区",
        "id": "450300"
    },
    "450400": {
        "name": "梧州市",
        "province": "广西壮族自治区",
        "id": "450400"
    },
    "450500": {
        "name": "北海市",
        "province": "广西壮族自治区",
        "id": "450500"
    },
    "450600": {
        "name": "防城港市",
        "province": "广西壮族自治区",
        "id": "450600"
    },
    "450700": {
        "name": "钦州市",
        "province": "广西壮族自治区",
        "id": "450700"
    },
    "450800": {
        "name": "贵港市",
        "province": "广西壮族自治区",
        "id": "450800"
    },
    "450900": {
        "name": "玉林市",
        "province": "广西壮族自治区",
        "id": "450900"
    },
    "451000": {
        "name": "百色市",
        "province": "广西壮族自治区",
        "id": "451000"
    },
    "451100": {
        "name": "贺州市",
        "province": "广西壮族自治区",
        "id": "451100"
    },
    "451200": {
        "name": "河池市",
        "province": "广西壮族自治区",
        "id": "451200"
    },
    "451300": {
        "name": "来宾市",
        "province": "广西壮族自治区",
        "id": "451300"
    },
    "451400": {
        "name": "崇左市",
        "province": "广西壮族自治区",
        "id": "451400"
    },
    "460100": {
        "name": "海口市",
        "province": "海南省",
        "id": "460100"
    },
    "460200": {
        "name": "三亚市",
        "province": "海南省",
        "id": "460200"
    },
    "469000": {
        "name": "省直辖县级行政单位",
        "province": "海南省",
        "id": "469000"
    },
    "500100": {
        "name": "市辖区",
        "province": "重庆市",
        "id": "500100"
    },
    "500200": {
        "name": "县",
        "province": "重庆市",
        "id": "500200"
    },
    "500300": {
        "name": "市",
        "province": "重庆市",
        "id": "500300"
    },
    "510100": {
        "name": "成都市",
        "province": "四川省",
        "id": "510100"
    },
    "510300": {
        "name": "自贡市",
        "province": "四川省",
        "id": "510300"
    },
    "510400": {
        "name": "攀枝花市",
        "province": "四川省",
        "id": "510400"
    },
    "510500": {
        "name": "泸州市",
        "province": "四川省",
        "id": "510500"
    },
    "510600": {
        "name": "德阳市",
        "province": "四川省",
        "id": "510600"
    },
    "510700": {
        "name": "绵阳市",
        "province": "四川省",
        "id": "510700"
    },
    "510800": {
        "name": "广元市",
        "province": "四川省",
        "id": "510800"
    },
    "510900": {
        "name": "遂宁市",
        "province": "四川省",
        "id": "510900"
    },
    "511000": {
        "name": "内江市",
        "province": "四川省",
        "id": "511000"
    },
    "511100": {
        "name": "乐山市",
        "province": "四川省",
        "id": "511100"
    },
    "511300": {
        "name": "南充市",
        "province": "四川省",
        "id": "511300"
    },
    "511400": {
        "name": "眉山市",
        "province": "四川省",
        "id": "511400"
    },
    "511500": {
        "name": "宜宾市",
        "province": "四川省",
        "id": "511500"
    },
    "511600": {
        "name": "广安市",
        "province": "四川省",
        "id": "511600"
    },
    "511700": {
        "name": "达州市",
        "province": "四川省",
        "id": "511700"
    },
    "511800": {
        "name": "雅安市",
        "province": "四川省",
        "id": "511800"
    },
    "511900": {
        "name": "巴中市",
        "province": "四川省",
        "id": "511900"
    },
    "512000": {
        "name": "资阳市",
        "province": "四川省",
        "id": "512000"
    },
    "513200": {
        "name": "阿坝藏族羌族自治州",
        "province": "四川省",
        "id": "513200"
    },
    "513300": {
        "name": "甘孜藏族自治州",
        "province": "四川省",
        "id": "513300"
    },
    "513400": {
        "name": "凉山彝族自治州",
        "province": "四川省",
        "id": "513400"
    },
    "520100": {
        "name": "贵阳市",
        "province": "贵州省",
        "id": "520100"
    },
    "520200": {
        "name": "六盘水市",
        "province": "贵州省",
        "id": "520200"
    },
    "520300": {
        "name": "遵义市",
        "province": "贵州省",
        "id": "520300"
    },
    "520400": {
        "name": "安顺市",
        "province": "贵州省",
        "id": "520400"
    },
    "522200": {
        "name": "铜仁地区",
        "province": "贵州省",
        "id": "522200"
    },
    "522300": {
        "name": "黔西南布依族苗族自治州",
        "province": "贵州省",
        "id": "522300"
    },
    "522400": {
        "name": "毕节地区",
        "province": "贵州省",
        "id": "522400"
    },
    "522600": {
        "name": "黔东南苗族侗族自治州",
        "province": "贵州省",
        "id": "522600"
    },
    "522700": {
        "name": "黔南布依族苗族自治州",
        "province": "贵州省",
        "id": "522700"
    },
    "530100": {
        "name": "昆明市",
        "province": "云南省",
        "id": "530100"
    },
    "530300": {
        "name": "曲靖市",
        "province": "云南省",
        "id": "530300"
    },
    "530400": {
        "name": "玉溪市",
        "province": "云南省",
        "id": "530400"
    },
    "530500": {
        "name": "保山市",
        "province": "云南省",
        "id": "530500"
    },
    "530600": {
        "name": "昭通市",
        "province": "云南省",
        "id": "530600"
    },
    "530700": {
        "name": "丽江市",
        "province": "云南省",
        "id": "530700"
    },
    "530800": {
        "name": "思茅市",
        "province": "云南省",
        "id": "530800"
    },
    "530900": {
        "name": "临沧市",
        "province": "云南省",
        "id": "530900"
    },
    "532300": {
        "name": "楚雄彝族自治州",
        "province": "云南省",
        "id": "532300"
    },
    "532500": {
        "name": "红河哈尼族彝族自治州",
        "province": "云南省",
        "id": "532500"
    },
    "532600": {
        "name": "文山壮族苗族自治州",
        "province": "云南省",
        "id": "532600"
    },
    "532800": {
        "name": "西双版纳傣族自治州",
        "province": "云南省",
        "id": "532800"
    },
    "532900": {
        "name": "大理白族自治州",
        "province": "云南省",
        "id": "532900"
    },
    "533100": {
        "name": "德宏傣族景颇族自治州",
        "province": "云南省",
        "id": "533100"
    },
    "533300": {
        "name": "怒江傈僳族自治州",
        "province": "云南省",
        "id": "533300"
    },
    "533400": {
        "name": "迪庆藏族自治州",
        "province": "云南省",
        "id": "533400"
    },
    "540100": {
        "name": "拉萨市",
        "province": "西藏自治区",
        "id": "540100"
    },
    "542100": {
        "name": "昌都地区",
        "province": "西藏自治区",
        "id": "542100"
    },
    "542200": {
        "name": "山南地区",
        "province": "西藏自治区",
        "id": "542200"
    },
    "542300": {
        "name": "日喀则地区",
        "province": "西藏自治区",
        "id": "542300"
    },
    "542400": {
        "name": "那曲地区",
        "province": "西藏自治区",
        "id": "542400"
    },
    "542500": {
        "name": "阿里地区",
        "province": "西藏自治区",
        "id": "542500"
    },
    "542600": {
        "name": "林芝地区",
        "province": "西藏自治区",
        "id": "542600"
    },
    "610100": {
        "name": "西安市",
        "province": "陕西省",
        "id": "610100"
    },
    "610200": {
        "name": "铜川市",
        "province": "陕西省",
        "id": "610200"
    },
    "610300": {
        "name": "宝鸡市",
        "province": "陕西省",
        "id": "610300"
    },
    "610400": {
        "name": "咸阳市",
        "province": "陕西省",
        "id": "610400"
    },
    "610500": {
        "name": "渭南市",
        "province": "陕西省",
        "id": "610500"
    },
    "610600": {
        "name": "延安市",
        "province": "陕西省",
        "id": "610600"
    },
    "610700": {
        "name": "汉中市",
        "province": "陕西省",
        "id": "610700"
    },
    "610800": {
        "name": "榆林市",
        "province": "陕西省",
        "id": "610800"
    },
    "610900": {
        "name": "安康市",
        "province": "陕西省",
        "id": "610900"
    },
    "611000": {
        "name": "商洛市",
        "province": "陕西省",
        "id": "611000"
    },
    "620100": {
        "name": "兰州市",
        "province": "甘肃省",
        "id": "620100"
    },
    "620200": {
        "name": "嘉峪关市",
        "province": "甘肃省",
        "id": "620200"
    },
    "620300": {
        "name": "金昌市",
        "province": "甘肃省",
        "id": "620300"
    },
    "620400": {
        "name": "白银市",
        "province": "甘肃省",
        "id": "620400"
    },
    "620500": {
        "name": "天水市",
        "province": "甘肃省",
        "id": "620500"
    },
    "620600": {
        "name": "武威市",
        "province": "甘肃省",
        "id": "620600"
    },
    "620700": {
        "name": "张掖市",
        "province": "甘肃省",
        "id": "620700"
    },
    "620800": {
        "name": "平凉市",
        "province": "甘肃省",
        "id": "620800"
    },
    "620900": {
        "name": "酒泉市",
        "province": "甘肃省",
        "id": "620900"
    },
    "621000": {
        "name": "庆阳市",
        "province": "甘肃省",
        "id": "621000"
    },
    "621100": {
        "name": "定西市",
        "province": "甘肃省",
        "id": "621100"
    },
    "621200": {
        "name": "陇南市",
        "province": "甘肃省",
        "id": "621200"
    },
    "622900": {
        "name": "临夏回族自治州",
        "province": "甘肃省",
        "id": "622900"
    },
    "623000": {
        "name": "甘南藏族自治州",
        "province": "甘肃省",
        "id": "623000"
    },
    "630100": {
        "name": "西宁市",
        "province": "青海省",
        "id": "630100"
    },
    "632100": {
        "name": "海东地区",
        "province": "青海省",
        "id": "632100"
    },
    "632200": {
        "name": "海北藏族自治州",
        "province": "青海省",
        "id": "632200"
    },
    "632300": {
        "name": "黄南藏族自治州",
        "province": "青海省",
        "id": "632300"
    },
    "632500": {
        "name": "海南藏族自治州",
        "province": "青海省",
        "id": "632500"
    },
    "632600": {
        "name": "果洛藏族自治州",
        "province": "青海省",
        "id": "632600"
    },
    "632700": {
        "name": "玉树藏族自治州",
        "province": "青海省",
        "id": "632700"
    },
    "632800": {
        "name": "海西蒙古族藏族自治州",
        "province": "青海省",
        "id": "632800"
    },
    "640100": {
        "name": "银川市",
        "province": "宁夏回族自治区",
        "id": "640100"
    },
    "640200": {
        "name": "石嘴山市",
        "province": "宁夏回族自治区",
        "id": "640200"
    },
    "640300": {
        "name": "吴忠市",
        "province": "宁夏回族自治区",
        "id": "640300"
    },
    "640400": {
        "name": "固原市",
        "province": "宁夏回族自治区",
        "id": "640400"
    },
    "640500": {
        "name": "中卫市",
        "province": "宁夏回族自治区",
        "id": "640500"
    },
    "650100": {
        "name": "乌鲁木齐市",
        "province": "新疆维吾尔自治区",
        "id": "650100"
    },
    "650200": {
        "name": "克拉玛依市",
        "province": "新疆维吾尔自治区",
        "id": "650200"
    },
    "652100": {
        "name": "吐鲁番地区",
        "province": "新疆维吾尔自治区",
        "id": "652100"
    },
    "652200": {
        "name": "哈密地区",
        "province": "新疆维吾尔自治区",
        "id": "652200"
    },
    "652300": {
        "name": "昌吉回族自治州",
        "province": "新疆维吾尔自治区",
        "id": "652300"
    },
    "652700": {
        "name": "博尔塔拉蒙古自治州",
        "province": "新疆维吾尔自治区",
        "id": "652700"
    },
    "652800": {
        "name": "巴音郭楞蒙古自治州",
        "province": "新疆维吾尔自治区",
        "id": "652800"
    },
    "652900": {
        "name": "阿克苏地区",
        "province": "新疆维吾尔自治区",
        "id": "652900"
    },
    "653000": {
        "name": "克孜勒苏柯尔克孜自治州",
        "province": "新疆维吾尔自治区",
        "id": "653000"
    },
    "653100": {
        "name": "喀什地区",
        "province": "新疆维吾尔自治区",
        "id": "653100"
    },
    "653200": {
        "name": "和田地区",
        "province": "新疆维吾尔自治区",
        "id": "653200"
    },
    "654000": {
        "name": "伊犁哈萨克自治州",
        "province": "新疆维吾尔自治区",
        "id": "654000"
    },
    "654200": {
        "name": "塔城地区",
        "province": "新疆维吾尔自治区",
        "id": "654200"
    },
    "654300": {
        "name": "阿勒泰地区",
        "province": "新疆维吾尔自治区",
        "id": "654300"
    },
    "659000": {
        "name": "省直辖行政单位",
        "province": "新疆维吾尔自治区",
        "id": "659000"
    }
}

export {
    city_object
}